БИТУправление_медицинским_центром_демо/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.Прием</types>
      <types>CatalogRef.МедицинскиеКарты</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Сертификаты</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/Штрихкоды/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает соответствие с данными штрихкодов.
//
// Параметры:
//  Штрихкоды - Массив из Строка - Массив штрихкодов
//
// Возвращаемое значение:
//  Неопределено - Соответствие с данными штрихкодов
//
Функция ПолучитьДанныеПоШтрихкодам(Штрихкоды) Экспорт
	
	ДанныеПоШтрихкодам = Новый Соответствие;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод						КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Владелец						КАК Владелец,
	|	ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры	КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатуры.СерияНоменклатуры				КАК СерияНоменклатуры,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения				КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В (&МассивШтрихкодов)
	|");
	
	МассивШтрихкодов = Новый Массив;
	
	Для Каждого ТекущийШтрихкод Из Штрихкоды Цикл
		МассивШтрихкодов.Добавить(ТекущийШтрихкод);
		ДанныеПоШтрихкодам.Вставить(ТекущийШтрихкод, ОбработкаТабличнойЧастиКлиентСервер.СтруктураКэшируемойИнформацииПоШтрихкоду(ТекущийШтрихкод));
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИнформацияПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		ИнформацияПоШтрихкоду.Владелец						= Выборка.Владелец;
		ИнформацияПоШтрихкоду.ХарактеристикаНоменклатуры	= Выборка.ХарактеристикаНоменклатуры;
		ИнформацияПоШтрихкоду.СерияНоменклатуры				= Выборка.СерияНоменклатуры;
		ИнформацияПоШтрихкоду.ЕдиницаИзмерения				= Выборка.ЕдиницаИзмерения;
		
		ИнформацияПоШтрихкоду.НеизвестныйШтрихкод = Ложь;
	КонецЦикла;
	
	Возврат ДанныеПоШтрихкодам;
	
КонецФункции
#КонецОбласти
